In [1]:
# Add Matplotlib inline magic command
%matplotlib inline
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
import os

In [2]:
# Files to load
city_data_to_load = "C:/Users/esobieski/Documents/Berkeley/PyBer_Analysis/Resources/city_data.csv"
ride_data_to_load = "C:/Users/esobieski/Documents/Berkeley/PyBer_Analysis/Resources/ride_data.csv"

In [3]:
# Read the city data file and store it in a pandas DataFrame.
city_data_df = pd.read_csv(city_data_to_load)

In [4]:
# Read the ride data file and store it in a pandas DataFrame.
ride_data_df = pd.read_csv(ride_data_to_load)

In [5]:
# Combine the data into a single dataset
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="outer", on=["city", "city"])

# Display the DataFrame
pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,1/14/2019 10:14,13.83,5.739410e+12,5,Urban
1,Lake Jonathanshire,4/7/2019 20:51,31.25,4.441250e+12,5,Urban
2,Lake Jonathanshire,3/9/2019 23:45,19.89,2.389500e+12,5,Urban
3,Lake Jonathanshire,4/7/2019 18:09,24.28,7.796810e+12,5,Urban
4,Lake Jonathanshire,1/2/2019 14:14,13.89,4.242550e+11,5,Urban

In [6]:
# Get the total number of rides for urban, suburban and rural city types.
total_ride_count = pyber_data_df.groupby(["type"]).count()
total_ride_count

          city  date  fare  ride_id  driver_count
type
Rural      125   125   125      125           125
Suburban   625   625   625      625           625
Urban     1625  1625  1625     1625          1625

In [7]:
# Get the total number of drivers for urban, suburban and rural city types.
driver_total = city_data_df.groupby(["type"]).sum()
driver_total

          driver_count
type
Rural               78
Suburban           490
Urban             2405

In [8]:
# Get the total number of fares for urban, suburban and rural city types.
fare_total = pyber_data_df.groupby(["type"]).sum()
fare_total

              fare       ride_id  driver_count
type
Rural      4327.93  5.809682e+14           537
Suburban  19356.33  3.106884e+15          8570
Urban     39854.38  7.919413e+15         59602

In [9]:
# Get Average fare per ride for urban, suburban and rural city types.
avg_fare_per_ride = fare_total/total_ride_count
avg_fare_per_ride

          city  date  driver_count       fare       ride_id
type
Rural      NaN   NaN      4.296000  34.623440  4.647746e+12
Suburban   NaN   NaN     13.712000  30.970128  4.971015e+12
Urban      NaN   NaN     36.678154  24.525772  4.873485e+12

In [12]:
# Get Average fare per driver for urban, suburban and rural city types.
avg_fare_per_driver = fare_total/driver_total
avg_fare_per_driver

          driver_count  fare  ride_id
type
Rural         6.884615   NaN      NaN
Suburban     17.489796   NaN      NaN
Urban        24.782536   NaN      NaN

In [13]:
# Combine the data into a single dataset
pyber_summary2_df = pd.merge(total_ride_count, driver_total, left_index=True, right_index=True, how='outer')
pyber_summary2_df

          city  date  fare  ride_id  driver_count_x  driver_count_y
type
Rural      125   125   125      125             125              78
Suburban   625   625   625      625             625             490
Urban     1625  1625  1625     1625            1625            2405

In [14]:
# Combine the data into a single dataset
pyber_summary3_df = pd.merge(pyber_summary2_df, fare_total, left_index=True, right_index=True, how='outer')
pyber_summary3_df

,city,date,fare_x,ride_id_x,driver_count_x,driver_count_y,fare_y,ride_id_y,driver_count
type,,,,,,,,,
Rural,125,125,125,125,125,78,4327.93,5.809682e+14,537
Suburban,625,625,625,625,625,490,19356.33,3.106884e+15,8570
Urban,1625,1625,1625,1625,1625,2405,39854.38,7.919413e+15,59602

In [15]:
# Combine the data into a single dataset
pyber_summary4_df = pd.merge(pyber_summary3_df, avg_fare_per_driver, left_index=True, right_index=True, how='outer')
pyber_summary4_df

,city,date,fare_x,ride_id_x,driver_count_x,driver_count_y,fare_y,ride_id_y,driver_count_x,driver_count_y,fare,ride_id
type,,,,,,,,,,,,
Rural,125,125,125,125,125,78,4327.93,5.809682e+14,537,6.884615,NaN,NaN
Suburban,625,625,625,625,625,490,19356.33,3.106884e+15,8570,17.489796,NaN,NaN
Urban,1625,1625,1625,1625,1625,2405,39854.38,7.919413e+15,59602,24.782536,NaN,NaN

In [16]:
# Combine the data into a single dataset
pyber_summary5_df = pd.merge(pyber_summary4_df, avg_fare_per_ride, left_index=True, right_index=True, how='outer')
pyber_summary5_df

,city_x,date_x,fare_x,ride_id_x,driver_count_x,driver_count_y,fare_y,ride_id_y,driver_count_x,driver_count_y,fare_x,ride_id_x,city_y,date_y,driver_count,fare_y,ride_id_y
type,,,,,,,,,,,,,,,,,
Rural,125,125,125,125,125,78,4327.93,5.809682e+14,537,6.884615,NaN,NaN,NaN,NaN,4.296000,34.623440,4.647746e+12
Suburban,625,625,625,625,625,490,19356.33,3.106884e+15,8570,17.489796,NaN,NaN,NaN,NaN,13.712000,30.970128,4.971015e+12
Urban,1625,1625,1625,1625,1625,2405,39854.38,7.919413e+15,59602,24.782536,NaN,NaN,NaN,NaN,36.678154,24.525772,4.873485e+12

In [22]:
#select columns for df
#pyber_summary5_df['city_x', 'driver_count_y', 'fare_x', 'fare_y', 'driver_count_y']

In [25]:
pyber_summary5_df['city_x'].values

array([ 125,  625, 1625], dtype=int64)

In [26]:
#create PyBer_Summary Dataframe, with formatting
PyBer_summary6_df=pd.DataFrame([{["Total Rides': pyber_summary5_df['city_x'].values,
                  'Total Drivers': pyber_summary5_df['driver_count_y'].values,
                  'Total Fares': pyber_summary5_df['fare_x'].values,
                  'Avg Fare per Ride': pyber_summary5_df['fare_y'].values,
                  'Avg Fare per Driver': pyber_summary5_df['driver_count_y'].values}])
PyBer_summary6_df.et_index

SyntaxError: EOL while scanning string literal (<ipython-input-26-bd480a2a15ed>, line 2)

In [ ]:
# Format the PyBer Summary to have the comma for a thousands separator, dollars and two decimals.
PyBer_summary_df["Total Rides"] = PyBer_summary_df["Total Rides"].map("{:,}".format)
PyBer_summary_df["Total Drivers"] = PyBer_summary_df["Total Drivers"].map("{:,}".format)
PyBer_summary_df["Total Fares"] = PyBer_summary_df["Total Fares"].map("${:,.2f}".format)
PyBer_summary_df["Avg Fare per Ride"] = PyBer_summary_df["Avg Fare per Ride"].map("${:,.2f}".format)
PyBer_summary_df["Avg Fare per Driver"] = PyBer_summary_df["Avg Fare per Driver"].map("${:,.2f}".format)
PyBer_summary_df

In [ ]:
# 1. Create a new dataframe and rename columns in pyber_data_df
p2_pyber_data_df= pyber_data_df.copy()

#p2_pyber_data_df.rename(columns={'city': 'City', 'date':'Date','fare':'Fare', 'ride_id': 'Ride Id','driver_count': 'No. Drivers', 'type':'City Type'}, inplace=True)
p2_pyber_data_df

In [ ]:
# 2. Set index to the Date column using reset_index()
#p2_pyber_data_df.reset_index(level='Date', col_level=1)
#p2_pyber_data_df

In [ ]:
# 3. Create new dataframe for fares and include only the Date, City Type, and Fare Columns using groupby(), and drop extra date column
#fares_summary_df=pd.DataFrame([{'Date': date,'City Type': type,'Total Fare': fare_total,}],drop=True)
#fares_summary_df.groupby(['type'])
#fares_summary_df

In [ ]:
# 4. Drop the extra date column (done above?)

In [ ]:
# 5. Set the index to the datetime data type
# Converting the index as date
#fares_summary_df.index = pd.to_datetime(fares_summary_df.index)

In [ ]:
# 6. Check the Dataframe using info() method to make sure the index is a datetime data type
#fares_summary_df.info()

In [ ]:
# 7. Calculate the sum() of fares by the type of city and date
#total_fares_by_city = fares_summary_df["City"].sum()
#total_fares_by_city

#total_fares_by_date = fares_summary_df["Date"].sum()
#total_fares_by_date

In [ ]:
# 8. Reset the index, which is needed for step 10

In [ ]:
# 9. Create a pivot table DataFrame with the Date as the index and Columns="City Type" with the Fare for each Date in each row.  
# Note: there will be NaNs in some rows, which will be taken care of when you sum based on Date.
# table = pd.pivot_table(fares_summary_df, values='D', index=['Date'],columns=['City Type'], aggfunc=np.sum)

In [ ]:
# 10. Create a new DataFrame from the pivot table DataFrame on the given dates '2019-01-10':'2019-04-28' using loc

In [ ]:
# 11. Create a new Dataframe by setting the Dataframe you created in Step 11 with resample() in weekly bins, 
# and calculate the sum of the fares each week

In [ ]:
# 12. Using Object-Oriented (ax) interface method, plot the dataframe you created in Step 11 with resample() using the df.plot() function.
# Import the style from matplotlib
import matplotlib.pyplot as plt
# Use the graph style fivethirtyeight
plt.style.use('fivethirtyeight')
# Make sure the figure is not too small

# Create a stacked line chart using fivethirtyeight plot for total fare by city type.
fig, ax = plt.subplots()
df.plot(x='Date', y='Fare', ylim=[0,2500], figsize=[12,12], ax=ax)
# Add the title, y-axis label and y.
ax.set_title('Total Fare by City Type', fontsize=20)
ax.set_xlabel('2019',fontsize=14)
ax.set_ylabel('Fare ($USD)', fontsize=14)
ax.set_yticks(np.arange(0, 2500, step=500))
# Add the legend.
ax.legend()
# Save the figure to the "analysis" folder
plt.savefig("C:/Users/esobieski/Documents/Berkeley/PyBer_Analysis/Analysis/Fig10.png")
plt.show()